# Задача 4. Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала 
# в 2 раза больше журавликов, чем Петя и Сережа вместе?

# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10 

S = int(input("Введите S - количество журавликов, которое ребята собрали вместе: "))

print(f"Петя собрал {S//6} журавликов")
print(f"Сережа собрал {S//6} журавликов")
print(f"Катя собрала {(S//6)*4} журавликов")