# Задача 6. Счастливый билет имеет 6-значный номер, где сумма первых трех цифр равна
# сумме трех последних. Напишите прорамму, проверяющую счастливость билета.

# 123456 -> no
# 385916 -> yes

a = str(input("Введите 6-значное число: "))

if (int(a[0]) + int(a[1]) + int(a[2])) == (int(a[3]) + int(a[4]) + int(a[5])):
    print("Да. Поздравляю, у вас счастливый билет!")
else:
    print("Нет. Увы, ваш билет не является счастливым.")