# Задача 8. Определите, можно ли от шоколадки размером n*m долек отломить k долек,
# если можно сделать один разлом по прямой между дольками (т.е. разломить шоколадку
# на 2 прямоугольника).

# 3 2 4 -> yes
# 3 2 1 -> no

n = int(input("Введите длину шоколадки (в дольках): "))
m = int(input("Введите ширину шоколадки (в дольках): "))
k = int(input("Введите количество долек, которое можно отломить от шоколадки за 1 раз: "))

if (k/n)%2 == 0 or (k/m)%2 == 0:
    print(f"Да. От шоколадки размерами {n}*{m} можно отломить {k} долек за 1 раз")
else:
    print(f"Нет. От шоколадки размерами {n}*{m} нельзя отломить {k} долек за 1 раз")