#Задача 16: Требуется вычислить, сколько раз встречается некоторое число X 
# в массиве A[1..N]. Пользователь в первой строке вводит 
# натуральное число N – количество элементов в массиве. В последующих строках 
# записаны N целых чисел Ai. Последняя строка содержит число X.

# 5 (N - количество элементов в массиве)
# 1 2 3 4 5 (массив)
# 3 (некоторое число X)
# -> 1 (сколько раз встречается некоторое число X в массиве)

from random import randint

N = int(input('Введите количество элементов в массиве: '))
X = int(input('Введите число X: '))
array = []
for i in range(N):
    array.append(randint(0, 9))

print(array)
print("Число",X, "встречается в массиве",array.count(X), "раз")