# Задача 30: Заполните массив элементами арифметической прогрессии. Её первый элемент, 
# разность и количество элементов нужно ввести с клавиатуры. Формула для получения 
# n-го члена прогрессии: an = a1 + (n-1) * d. Каждое число вводится с новой строки.

#Ввод: 7 2 5
#Вывод: 7 9 11 13 15

print("Формула арфиметической прогрессии: an = a1 + (n-1) * d")
a1 = int(input('Введите a1 - 1ый элемент прогрессии: '))
d = int(input('Введите d - разность 2го и 1го элементов: '))
n = int(input('Введите n - количество элементов: '))

arr = list()
for i in range(n):
    print(a1, end =' ')
    a1 = a1 + d