#Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются 
# в обоих наборах. Пользователь вводит 2 числа. n - кол-во элементов первого множества. 
# m - кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

# 11 6 2 4 6 8 10 12 10 8 6 4 2 (13 штук)
# 3 6 9 12 15 18 (6 штук)
# 6 12

arr1 = set([int(input('Элемент: ')) for _ in range(int(input('Кол-во элементов 1-ой последовательности: ')))])
print(arr1)

arr2 = set([int(input('Элемент: ')) for _ in range(int(input('Кол-во элементов 2-ой последовательности: ')))])
print(arr2)

print(sorted(arr1.intersection(arr2)))